----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 240, 320]           9,408
       BatchNorm2d-2         [-1, 64, 240, 320]             128
              ReLU-3         [-1, 64, 240, 320]               0
         MaxPool2d-4         [-1, 64, 120, 160]               0
       ChannelPool-5           [-1, 2, 64, 160]               0
            Conv2d-6           [-1, 1, 64, 160]              98
       BatchNorm2d-7           [-1, 1, 64, 160]               2
         BasicConv-8           [-1, 1, 64, 160]               0
       SpatialGate-9         [-1, 120, 64, 160]               0
      ChannelPool-10           [-1, 2, 120, 64]               0
           Conv2d-11           [-1, 1, 120, 64]              98
      BatchNorm2d-12           [-1, 1, 120, 64]               2
        BasicConv-13           [-1, 1, 120, 64]               0
      SpatialGate-14         [-1, 160, 120, 64]               0
      ChannelPool-15          [-1, 2, 120, 160]               0
           Conv2d-16          [-1, 1, 120, 160]              98
      BatchNorm2d-17          [-1, 1, 120, 160]               2
        BasicConv-18          [-1, 1, 120, 160]               0
      SpatialGate-19         [-1, 64, 120, 160]               0
 TripletAttention-20         [-1, 64, 120, 160]               0
           Conv2d-21          [-1, 1, 120, 160]              98
          Sigmoid-22          [-1, 1, 120, 160]               0
 SpatialAttention-23          [-1, 1, 120, 160]               0
           Conv2d-24         [-1, 64, 120, 160]           4,096
      BatchNorm2d-25         [-1, 64, 120, 160]             128
             ReLU-26         [-1, 64, 120, 160]               0
           Conv2d-27        [-1, 256, 120, 160]         147,456
      BatchNorm2d-28        [-1, 256, 120, 160]             512
           Conv2d-29        [-1, 256, 120, 160]          16,384
      BatchNorm2d-30        [-1, 256, 120, 160]             512
             ReLU-31        [-1, 256, 120, 160]               0
       Bottleneck-32        [-1, 256, 120, 160]               0
           Conv2d-33        [-1, 128, 120, 160]          32,768
      BatchNorm2d-34        [-1, 128, 120, 160]             256
             ReLU-35        [-1, 128, 120, 160]               0
           Conv2d-36          [-1, 512, 60, 80]         589,824
      BatchNorm2d-37          [-1, 512, 60, 80]           1,024
           Conv2d-38          [-1, 512, 60, 80]         131,072
      BatchNorm2d-39          [-1, 512, 60, 80]           1,024
             ReLU-40          [-1, 512, 60, 80]               0
       Bottleneck-41          [-1, 512, 60, 80]               0
      ChannelPool-42           [-1, 2, 512, 80]               0
           Conv2d-43           [-1, 1, 512, 80]              98
      BatchNorm2d-44           [-1, 1, 512, 80]               2
        BasicConv-45           [-1, 1, 512, 80]               0
      SpatialGate-46          [-1, 60, 512, 80]               0
      ChannelPool-47           [-1, 2, 60, 512]               0
           Conv2d-48           [-1, 1, 60, 512]              98
      BatchNorm2d-49           [-1, 1, 60, 512]               2
        BasicConv-50           [-1, 1, 60, 512]               0
      SpatialGate-51          [-1, 80, 60, 512]               0
      ChannelPool-52            [-1, 2, 60, 80]               0
           Conv2d-53            [-1, 1, 60, 80]              98
      BatchNorm2d-54            [-1, 1, 60, 80]               2
        BasicConv-55            [-1, 1, 60, 80]               0
      SpatialGate-56          [-1, 512, 60, 80]               0
 TripletAttention-57          [-1, 512, 60, 80]               0
           Conv2d-58            [-1, 1, 60, 80]              98
          Sigmoid-59            [-1, 1, 60, 80]               0
 SpatialAttention-60            [-1, 1, 60, 80]               0
           Conv2d-61          [-1, 256, 60, 80]         131,072
      BatchNorm2d-62          [-1, 256, 60, 80]             512
             ReLU-63          [-1, 256, 60, 80]               0
           Conv2d-64         [-1, 1024, 30, 40]       2,359,296
      BatchNorm2d-65         [-1, 1024, 30, 40]           2,048
           Conv2d-66         [-1, 1024, 30, 40]         524,288
      BatchNorm2d-67         [-1, 1024, 30, 40]           2,048
             ReLU-68         [-1, 1024, 30, 40]               0
       Bottleneck-69         [-1, 1024, 30, 40]               0
      ChannelPool-70          [-1, 2, 1024, 40]               0
           Conv2d-71          [-1, 1, 1024, 40]              98
      BatchNorm2d-72          [-1, 1, 1024, 40]               2
        BasicConv-73          [-1, 1, 1024, 40]               0
      SpatialGate-74         [-1, 30, 1024, 40]               0
      ChannelPool-75          [-1, 2, 30, 1024]               0
           Conv2d-76          [-1, 1, 30, 1024]              98
      BatchNorm2d-77          [-1, 1, 30, 1024]               2
        BasicConv-78          [-1, 1, 30, 1024]               0
      SpatialGate-79         [-1, 40, 30, 1024]               0
      ChannelPool-80            [-1, 2, 30, 40]               0
           Conv2d-81            [-1, 1, 30, 40]              98
      BatchNorm2d-82            [-1, 1, 30, 40]               2
        BasicConv-83            [-1, 1, 30, 40]               0
      SpatialGate-84         [-1, 1024, 30, 40]               0
 TripletAttention-85         [-1, 1024, 30, 40]               0
           Conv2d-86            [-1, 1, 30, 40]              98
          Sigmoid-87            [-1, 1, 30, 40]               0
 SpatialAttention-88            [-1, 1, 30, 40]               0
           Conv2d-89          [-1, 256, 30, 40]         262,144
      BatchNorm2d-90          [-1, 256, 30, 40]             512
             ReLU-91          [-1, 256, 30, 40]               0
           Conv2d-92         [-1, 1024, 30, 40]       2,359,296
      BatchNorm2d-93         [-1, 1024, 30, 40]           2,048
             ReLU-94         [-1, 1024, 30, 40]               0
       Bottleneck-95         [-1, 1024, 30, 40]               0
              RCN-96  [[-1, 1024, 30, 40], [-1, 256, 120, 160]]               0
           Conv2d-97          [-1, 512, 30, 40]         524,288
      BatchNorm2d-98          [-1, 512, 30, 40]           1,024
             ReLU-99          [-1, 512, 30, 40]               0
       AEDModule-100          [-1, 512, 30, 40]               0
          Conv2d-101          [-1, 256, 30, 40]       2,359,296
     BatchNorm2d-102          [-1, 256, 30, 40]             512
            ReLU-103          [-1, 256, 30, 40]               0
       AEDModule-104          [-1, 256, 30, 40]               0
          Conv2d-105          [-1, 512, 30, 40]       4,718,592
     BatchNorm2d-106          [-1, 512, 30, 40]           1,024
            ReLU-107          [-1, 512, 30, 40]               0
       AEDModule-108          [-1, 512, 30, 40]               0
          Conv2d-109          [-1, 256, 30, 40]       2,359,296
     BatchNorm2d-110          [-1, 256, 30, 40]             512
            ReLU-111          [-1, 256, 30, 40]               0
       AEDModule-112          [-1, 256, 30, 40]               0
          Conv2d-113          [-1, 256, 30, 40]         196,608
     BatchNorm2d-114          [-1, 256, 30, 40]             512
            ReLU-115          [-1, 256, 30, 40]               0
         Dropout-116          [-1, 256, 30, 40]               0
          Conv2d-117          [-1, 256, 30, 40]         196,608
     BatchNorm2d-118          [-1, 256, 30, 40]             512
            ReLU-119          [-1, 256, 30, 40]               0
         Dropout-120          [-1, 256, 30, 40]               0
          Conv2d-121          [-1, 256, 30, 40]         393,216
     BatchNorm2d-122          [-1, 256, 30, 40]             512
            ReLU-123          [-1, 256, 30, 40]               0
         Dropout-124          [-1, 256, 30, 40]               0
             AED-125  [[-1, 256, 30, 40], [-1, 256, 30, 40], [-1, 256, 30, 40]]               0
          Conv2d-126         [-1, 48, 120, 160]          12,288
     BatchNorm2d-127         [-1, 48, 120, 160]              96
            ReLU-128         [-1, 48, 120, 160]               0
          Conv2d-129        [-1, 256, 120, 160]       1,290,240
     BatchNorm2d-130        [-1, 256, 120, 160]             512
            ReLU-131        [-1, 256, 120, 160]               0
          Conv2d-132        [-1, 304, 120, 160]         831,744
     BatchNorm2d-133        [-1, 304, 120, 160]             608
            ReLU-134        [-1, 304, 120, 160]               0
          Conv2d-135        [-1, 256, 120, 160]         589,824
     BatchNorm2d-136        [-1, 256, 120, 160]             512
            ReLU-137        [-1, 256, 120, 160]               0
         Dropout-138        [-1, 256, 120, 160]               0
          Conv2d-139        [-1, 128, 120, 160]         294,912
     BatchNorm2d-140        [-1, 128, 120, 160]             256
            ReLU-141        [-1, 128, 120, 160]               0
         Dropout-142        [-1, 128, 120, 160]               0
 ConvTranspose2d-143        [-1, 128, 240, 320]          65,664
            ReLU-144        [-1, 128, 240, 320]               0
          Conv2d-145          [-1, 1, 240, 320]             129
          Conv2d-146        [-1, 256, 120, 160]         700,416
     BatchNorm2d-147        [-1, 256, 120, 160]             512
            ReLU-148        [-1, 256, 120, 160]               0
         Dropout-149        [-1, 256, 120, 160]               0
          Conv2d-150        [-1, 256, 120, 160]         589,824
     BatchNorm2d-151        [-1, 256, 120, 160]             512
            ReLU-152        [-1, 256, 120, 160]               0
         Dropout-153        [-1, 256, 120, 160]               0
 ConvTranspose2d-154        [-1, 256, 240, 320]         262,400
            ReLU-155        [-1, 256, 240, 320]               0
          Conv2d-156        [-1, 120, 240, 320]          30,840
          Conv2d-157        [-1, 256, 120, 160]         700,416
     BatchNorm2d-158        [-1, 256, 120, 160]             512
            ReLU-159        [-1, 256, 120, 160]               0
         Dropout-160        [-1, 256, 120, 160]               0
          Conv2d-161        [-1, 128, 120, 160]         294,912
     BatchNorm2d-162        [-1, 128, 120, 160]             256
            ReLU-163        [-1, 128, 120, 160]               0
         Dropout-164        [-1, 128, 120, 160]               0
 ConvTranspose2d-165        [-1, 128, 240, 320]          65,664
            ReLU-166        [-1, 128, 240, 320]               0
          Conv2d-167          [-1, 1, 240, 320]             129
           Grasp-168  [[-1, 1, 240, 320], [-1, 120, 240, 320], [-1, 1, 240, 320]]               0
================================================================
Total params: 23,064,740
Trainable params: 23,064,740
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.52
Forward/backward pass size (MB): 635857922603.39
Params size (MB): 87.99
Estimated Total Size (MB): 635857922694.89
----------------------------------------------------------------
